// 1주일 중 특정 시간에만 이용 가능한 서비스가 있습니다.
// 시간 패턴이 주어졌을 때 현재 시간이 이용 가능한 시간인지 판단하는 함수를 만들어주세요.

// # 요구사항
// - **시간 패턴의 형식은 자유입니다.** 사람이 읽지 못하는 형식이여도 됩니다.
// - 함수는 패턴이 매개변수로 주어지고, 현재 시간이 이용 가능한 시간이면 true, 아니면 false를 반환합니다.
// - 결과 검증에 사용한 코드와 데이터도 포함해주세요.
// - 매개변수에 대한 검증은 필요하지 않습니다.
// - 이런 함수가 필요한 상황에 대해서 생각해봐주세요.
// - (선택사항) 주요 로직 부분이 20줄 이상 넘지 않도록 해보세요

// # 평가기준
// - 로직 이해도
// - 코드 구성 / 코드 가독성 (불필요한 주석은 없는 것을 선호합니다)
// - 테스트 구성

// # 시간 패턴 예
// - 평일 09:00~18:00, 토요일 09:00~13:00'
// - 토,일 09:00~18:00

